Paciente8159/uCNC/uCNC/mcus/stm32f10x/deprecated/startup_stm32f10x.c
#include "config.h"
#include "stm32f1xx_hal.h"
#include <stdint.h>
//#include "system_stm32f10x.h"

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler Function Prototype
 *----------------------------------------------------------------------------*/
typedef void (*const pfunc)(void);

/*----------------------------------------------------------------------------
  External References
 *----------------------------------------------------------------------------*/
extern uint32_t _stext;  /* start of program code */
extern uint32_t _etext;  /* end of end of program code */
extern uint32_t _sdata;  /* start of initialized global and static variables */
extern uint32_t _edata;  /* end of initialized global and static variables */
extern uint32_t _sbss;   /* start of uninitialized global and static variables */
extern uint32_t _ebss;   /* end of uninitialized global and static variables */
extern uint32_t _sstack; /* start of stack */
extern uint32_t _estack; /* end of stack */

extern void main(void) __attribute__((noreturn));

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
static void Default_IRQHandler(void) __attribute__((interrupt, noreturn));
static void Reset_IRQHandler(void) __attribute__((interrupt, noreturn));

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/

/*void *****  Cortex-M3 Processor Exceptions Numbers ***************************************************/
void NonMaskableInt_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void HardFault_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void MemoryManagement_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void BusFault_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void UsageFault_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SVCall_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DebugMonitor_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void PendSV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SysTick_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));

/******  STM32 specific Interrupt Numbers *********************************************************/
void WWDG_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void PVD_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TAMPER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void FLASH_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RCC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI0_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel6_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA1_Channel7_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));

#ifdef STM32F10X_LD
void ADC1_2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USB_HP_CAN1_TX_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USB_LP_CAN1_RX0_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CAN1_RX1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CAN1_SCE_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_BRK_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_UP_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_TRG_COM_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USBWakeUp_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
#endif /* STM32F10X_LD */  

#ifdef STM32F10X_LD_VL
void ADC1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_BRK_TIM15_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_UP_TIM16_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_TRG_COM_TIM17_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CEC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM6_DAC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM7_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
#endif /* STM32F10X_LD_VL */

#ifdef STM32F10X_MD
void ADC1_2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USB_HP_CAN1_TX_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USB_LP_CAN1_RX0_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CAN1_RX1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CAN1_SCE_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_BRK_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_UP_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_TRG_COM_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USBWakeUp_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
#endif /* STM32F10X_MD */  

#ifdef STM32F10X_MD_VL
void ADC1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_BRK_TIM15_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_UP_TIM16_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_TRG_COM_TIM17_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CEC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM6_DAC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM7_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
#endif /* STM32F10X_MD_VL */

#ifdef STM32F10X_HD
void ADC1_2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USB_HP_CAN1_TX_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USB_LP_CAN1_RX0_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CAN1_RX1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CAN1_SCE_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_BRK_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_UP_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_TRG_COM_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USBWakeUp_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM8_BRK_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM8_UP_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM8_TRG_COM_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM8_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void ADC3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void FSMC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SDIO_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void UART4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void UART5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM6_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM7_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel4_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
#endif /* STM32F10X_HD */  

#ifdef STM32F10X_HD_VL
void ADC1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI9_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_BRK_TIM15_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_UP_TIM16_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_TRG_COM_TIM17_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM1_CC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C1_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_EV_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void I2C2_ER_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void USART3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void EXTI15_10_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void RTCAlarm_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void CEC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM12_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM13_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM14_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void SPI3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void UART4_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void UART5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM6_DAC_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void TIM7_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel1_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel2_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel3_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel4_5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
void DMA2_Channel5_IRQHandler(void) __attribute__((weak, interrupt, interrupt, alias("Default_IRQHandler")));
                                mapped at position 60 only if the MISC_REMAP bit in 
                                the AFIO_MAPR2 register is set)                      */       
#endif /* STM32F10X_HD_VL */

