Paciente8159/uCNC/uCNC/mcus/stm32f10x/deprecated/startup_stm32f10x.c
#ifdef STM32F10X_HD
        ADC1_2_IRQHandler,      /*!< ADC1 and ADC2 global Interrupt                       */
    USB_HP_CAN1_TX_IRQHandler,  /*!< USB Device High Priority or CAN1 TX Interrupts       */
    USB_LP_CAN1_RX0_IRQHandler, /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
    CAN1_RX1_IRQHandler,        /*!< CAN1 RX1 Interrupt                                   */
    CAN1_SCE_IRQHandler,        /*!< CAN1 SCE Interrupt                                   */
    EXTI9_5_IRQHandler,         /*!< External Line[9:5] Interrupts                        */
    TIM1_BRK_IRQHandler,        /*!< TIM1 Break Interrupt                                 */
    TIM1_UP_IRQHandler,         /*!< TIM1 Update Interrupt                                */
    TIM1_TRG_COM_IRQHandler,    /*!< TIM1 Trigger and Commutation Interrupt               */
    TIM1_CC_IRQHandler,         /*!< TIM1 Capture Compare Interrupt                       */
    TIM2_IRQHandler,            /*!< TIM2 global Interrupt                                */
    TIM3_IRQHandler,            /*!< TIM3 global Interrupt                                */
    TIM4_IRQHandler,            /*!< TIM4 global Interrupt                                */
    I2C1_EV_IRQHandler,         /*!< I2C1 Event Interrupt                                 */
    I2C1_ER_IRQHandler,         /*!< I2C1 Error Interrupt                                 */
    I2C2_EV_IRQHandler,         /*!< I2C2 Event Interrupt                                 */
    I2C2_ER_IRQHandler,         /*!< I2C2 Error Interrupt                                 */
    SPI1_IRQHandler,            /*!< SPI1 global Interrupt                                */
    SPI2_IRQHandler,            /*!< SPI2 global Interrupt                                */
    USART1_IRQHandler,          /*!< USART1 global Interrupt                              */
    USART2_IRQHandler,          /*!< USART2 global Interrupt                              */
    USART3_IRQHandler,          /*!< USART3 global Interrupt                              */
    EXTI15_10_IRQHandler,       /*!< External Line[15:10] Interrupts                      */
    RTCAlarm_IRQHandler,        /*!< RTC Alarm through EXTI Line Interrupt                */
    USBWakeUp_IRQHandler,       /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
    TIM8_BRK_IRQHandler,        /*!< TIM8 Break Interrupt                                 */
    TIM8_UP_IRQHandler,         /*!< TIM8 Update Interrupt                                */
    TIM8_TRG_COM_IRQHandler,    /*!< TIM8 Trigger and Commutation Interrupt               */
    TIM8_CC_IRQHandler,         /*!< TIM8 Capture Compare Interrupt                       */
    ADC3_IRQHandler,            /*!< ADC3 global Interrupt                                */
    FSMC_IRQHandler,            /*!< FSMC global Interrupt                                */
    SDIO_IRQHandler,            /*!< SDIO global Interrupt                                */
    TIM5_IRQHandler,            /*!< TIM5 global Interrupt                                */
    SPI3_IRQHandler,            /*!< SPI3 global Interrupt                                */
    UART4_IRQHandler,           /*!< UART4 global Interrupt                               */
    UART5_IRQHandler,           /*!< UART5 global Interrupt                               */
    TIM6_IRQHandler,            /*!< TIM6 global Interrupt                                */
    TIM7_IRQHandler,            /*!< TIM7 global Interrupt                                */
    DMA2_Channel1_IRQHandler,   /*!< DMA2 Channel 1 global Interrupt                      */
    DMA2_Channel2_IRQHandler,   /*!< DMA2 Channel 2 global Interrupt                      */
    DMA2_Channel3_IRQHandler,   /*!< DMA2 Channel 3 global Interrupt                      */
    DMA2_Channel4_5_IRQHandler  /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
#endif                   /* STM32F10X_HD */

#ifdef STM32F10X_HD_VL
        ADC1_IRQHandler,           /*!< ADC1 global Interrupt                                */
    EXTI9_5_IRQHandler,            /*!< External Line[9:5] Interrupts                        */
    TIM1_BRK_TIM15_IRQHandler,     /*!< TIM1 Break and TIM15 Interrupts                      */
    TIM1_UP_TIM16_IRQHandler,      /*!< TIM1 Update and TIM16 Interrupts                     */
    TIM1_TRG_COM_TIM17_IRQHandler, /*!< TIM1 Trigger and Commutation and TIM17 Interrupt     */
    TIM1_CC_IRQHandler,            /*!< TIM1 Capture Compare Interrupt                       */
    TIM2_IRQHandler,               /*!< TIM2 global Interrupt                                */
    TIM3_IRQHandler,               /*!< TIM3 global Interrupt                                */
    TIM4_IRQHandler,               /*!< TIM4 global Interrupt                                */
    I2C1_EV_IRQHandler,            /*!< I2C1 Event Interrupt                                 */
    I2C1_ER_IRQHandler,            /*!< I2C1 Error Interrupt                                 */
    I2C2_EV_IRQHandler,            /*!< I2C2 Event Interrupt                                 */
    I2C2_ER_IRQHandler,            /*!< I2C2 Error Interrupt                                 */
    SPI1_IRQHandler,               /*!< SPI1 global Interrupt                                */
    SPI2_IRQHandler,               /*!< SPI2 global Interrupt                                */
    USART1_IRQHandler,             /*!< USART1 global Interrupt                              */
    USART2_IRQHandler,             /*!< USART2 global Interrupt                              */
    USART3_IRQHandler,             /*!< USART3 global Interrupt                              */
    EXTI15_10_IRQHandler,          /*!< External Line[15:10] Interrupts                      */
    RTCAlarm_IRQHandler,           /*!< RTC Alarm through EXTI Line Interrupt                */
    CEC_IRQHandler,                /*!< HDMI-CEC Interrupt                                   */
    TIM12_IRQHandler,              /*!< TIM12 global Interrupt                               */
    TIM13_IRQHandler,              /*!< TIM13 global Interrupt                               */
    TIM14_IRQHandler,              /*!< TIM14 global Interrupt                               */
    TIM5_IRQHandler,               /*!< TIM5 global Interrupt                                */
    SPI3_IRQHandler,               /*!< SPI3 global Interrupt                                */
    UART4_IRQHandler,              /*!< UART4 global Interrupt                               */
    UART5_IRQHandler,              /*!< UART5 global Interrupt                               */
    TIM6_DAC_IRQHandler,           /*!< TIM6 and DAC underrun Interrupt                      */
    TIM7_IRQHandler,               /*!< TIM7 Interrupt                                       */
    DMA2_Channel1_IRQHandler,      /*!< DMA2 Channel 1 global Interrupt                      */
    DMA2_Channel2_IRQHandler,      /*!< DMA2 Channel 2 global Interrupt                      */
    DMA2_Channel3_IRQHandler,      /*!< DMA2 Channel 3 global Interrupt                      */
    DMA2_Channel4_5_IRQHandler,    /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
    DMA2_Channel5_IRQHandler       /*!< DMA2 Channel 5 global Interrupt (DMA2 Channel 5 is 
                                             mapped at position 60 only if the MISC_REMAP bit in 
                                             the AFIO_MAPR2 register is set)                      */
#endif                      /* STM32F10X_HD_VL */

